电脑/c语言/链接装载和库.org
#+TITLE: 链接装载和库
#+AUTHOR: 万泽(德山书生)
#+CREATOR: wanze(<a href="mailto:a358003542@gmail.com">a358003542@gmail.com</a>)
#+DESCRIPTION: 制作者邮箱：a358003542@gmail.com


* 基本概念
参考了 [[http://www.cnblogs.com/skynet/p/3372855.html][这篇文章]] 。

库是可执行代码的二进制形式，可以被操作系统载入内存执行。库有静态库（.a, .lib）和动态库（.so, .dll）两种。


* 静态库
静态库在链接的时候会将目标文件(.o) 用到的引用库一起链接打包可执行文件中。

linux下用 *ar* 工具， windows下用 *lib.exe* 将目标文件链接起来。
 
linux下静态库的命名规范是 ~lib[lib_name].a~ 

linux下制作静态库的过程是：
1. 将各个代码文件编译为.o文件
#+BEGIN_EXAMPLE
gcc -c what.c
#+END_EXAMPLE

2. 用ar命令将各个汇编文件链接为.a静态库文件
#+BEGIN_EXAMPLE
ar -crv libwhat.a what.o
#+END_EXAMPLE


linux使用静态库文件是在编译的时候用 ~-L~ 选项指定静态库搜索路径，用 ~-l~ 来指定具体的静态库文件名， ~-l~ 指定的时候不需要写lib前缀和.a后缀。

windows下的情况暂时先略过。


* 动态库
linux下动态库的命名规则是 ~lib[name].so~ 。

linux下制作动态库直接通过编译器进行：
#+BEGIN_EXAMPLE
gcc -fPIC -shared -o libwhat.so what.c
#+END_EXAMPLE

linux下使用动态库需要将动态库放入系统文件夹 ~/lib~ 或 ~/usr/lib~ 中，然后还需要运行命令：
#+BEGIN_EXAMPLE
ldconfig
#+END_EXAMPLE

ldconfig命令是一个动态链接库管理命令，一般往 ~/lib~ 或 ~/usr/lib~ 里面直接加文件还需要运行ldconfig命令来更新下 ~/etc/ld.so.cache~ 文件。



引用动态库两个选项含义和静态库是一样的：

 ~-L~ 选项指定静态库搜索路径，用 ~-l~ 来指定具体的静态库文件名， ~-l~ 指定的时候不需要写lib前缀和.a后缀。



windows下创建.dll的过程先略过。


* 参考资料
1. 程序员的自我修养——链接装载和库
